import matplotlib.pyplot as plt
from typing import Dict


def printResultDict(res: Dict):
    print('目标函数值 =', res['cost'])
    print('=============================================================================')
    print('|     发电机数据                                                             |')
    print('=============================================================================')
    print('发电机编号     节点编号     有功出力     无功出力      发电费用')
    print('---------     --------    --------    ---------     -------')

    print('=============================================================================')
    print('|     节点数据                                                               |')
    print('=============================================================================')
    print('节点编号      电压幅值(pu)     电压相角(rad)     有功负荷(MW)      无功负荷(MVar)')
    print('--------     ------------     ------------     -----------      -------------')


    print('=============================================================================')
    print('|     支路数据                                                               |')
    print('=============================================================================')
    print('支路编号   起始节点编号   末端节点编号  起始节点注入有功(MW)   末端节点注入有功(MW)')
    print('-------   -----------   -----------  ------------------    ------------------')



def plotGapList(iterList, gapList):
    plt.yscale('log')
    plt.plot(iterList, gapList, linestyle='--', marker='x')
    plt.show()
